In [3]:
import pandas as pd
import numpy as np

Pandas are used to store and run analysis on bulky rationale dataset. 

Pandas have two types of data structure 1. Series and 2. Dataframe.
Both of these data structure are case sensitive!

1. Pandas Series:
Indexing and Slicing exits.
1-D arrays that can store any data type unlike numpy array. While defining a pandas series we need to define the data and its index (optional). Only 1-D data can be provided as an input to series.  Can we anyhow put nd data in pandas series??

    Input can be a scaler value, Dict, nd array, list or tuple

2. Pandas Dataframe: 
Combination of Index and Coll Names
Indexing and Slicing exits
2-D, Mutable, Hetrogenious data structure. It has labelled rows and colls numbers

    Input can be a scaler value, Dict, nd array, list or tuple

# 1. Pandas Series

In [8]:
# Creation of series:

# 1. Using np array
my_ser=pd.Series(np.array([1,2,3]))
my_ser

0    1
1    2
2    3
dtype: int64

In [9]:
# 2. Using scaler value

my_ser=pd.Series(32)
my_ser

0    32
dtype: int64

In [11]:
# 3. Using dict

my_ser=pd.Series({"key1":"pandas","key2":"numpy"}) #Note the index is taken up by keys!
my_ser

key1    pandas
key2     numpy
dtype: object

In [15]:
    # What if we try to add a index to dict data input:
data_dict={1:'jaipur','28588':'bhopal',3:'delhi',4:'patna',5:'jabalpur',6:'ajax'}
index=(9,9,9,1,9,9)
b=pd.Series(data_dict,index)
b

9       NaN
9       NaN
9       NaN
1    jaipur
9       NaN
9       NaN
dtype: object

In [12]:
# 4. Providing index values

data=['jaipur','bhopal','delhi','patna','jabalpur','ajax']

    #Providing index values this time to the data
index=['s','i','s','u','tty',8] 
a=pd.Series(data,index)
a

s        jaipur
i        bhopal
s         delhi
u         patna
tty    jabalpur
8          ajax
dtype: object

In [13]:
# 5. Pandas series can have hetrogenious data type:

d=[1,2.0,"str",[1,2,3]]
b=pd.Series(d)
b

0            1
1          2.0
2          str
3    [1, 2, 3]
dtype: object

In [14]:
        #Numpy will not work!
d=[1,2.0,"str",[1,2,3]]
b=np.array(d)
b

ValueError: setting an array element with a sequence. The requested array has an inhomogeneous shape after 1 dimensions. The detected shape was (4,) + inhomogeneous part.

Can we put a ndimension data value in pandas series?

We can add a sequence of data in the series, the individual data type can be a n dim.

In [17]:
arr1=np.array([[1,2,3],[3,4,5]])
arr1.ndim

2

In [18]:
arr2=np.array([[10,20,30],[300,400,-5]])
arr2.ndim

2

In [19]:
data=(arr1,arr2) #this is a sequence of 2d array
index=(10,20)

ser=pd.Series(data,index)
ser

10            [[1, 2, 3], [3, 4, 5]]
20    [[10, 20, 30], [300, 400, -5]]
dtype: object

# 1.1 Series Function

1. Aggregate Functions:
Pandas Series.aggregate() function aggregate using one or more operations over the specified axis in the given series object.

In [31]:
sr = pd.Series([1,2,3,4,5,6,7])

sr.agg([min,max,sum])

/var/folders/0b/3t3ybbj57qz9mgtyr3khlc1w0000gn/T/ipykernel_89790/3916131715.py:3: FutureWarning: The provided callable <built-in function min> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  sr.agg([min,max,sum])
/var/folders/0b/3t3ybbj57qz9mgtyr3khlc1w0000gn/T/ipykernel_89790/3916131715.py:3: FutureWarning: The provided callable <built-in function max> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  sr.agg([min,max,sum])
/var/folders/0b/3t3ybbj57qz9mgtyr3khlc1w0000gn/T/ipykernel_89790/3916131715.py:3: FutureWarning: The provided callable <built-in function sum> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  sr.agg([min,max,sum])

min     1
max     7
sum    28
dtype: int64

2. Concatinating Series:
Series can be concat just like list, but always reset the index.

In [33]:
# Creating two Series
sr1 = pd.Series([1, -2, 3])
sr2 = pd.Series([1, 2, 3])

# Concatenating the Series
sr3 = pd.concat([sr2, sr1])

print(sr3)

0    1
1    2
2    3
0    1
1   -2
2    3
dtype: int64

In [34]:
# Creating two Series
sr1 = pd.Series([1, -2, 3])
sr2 = pd.Series([1, 2, 3])

# Concatenating the Series and resetting the index
sr3 = pd.concat([sr2, sr1]).reset_index(drop=True)

print(sr3)

0    1
1    2
2    3
3    1
4   -2
5    3
dtype: int64

3. Astype: Its used to change the datatype in series

In [44]:
sr1=pd.Series([1,2,3,4])
sr1

0    1
1    2
2    3
3    4
dtype: int64

In [45]:
sr1.astype("float")

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

4. Between Function: To check if the values exits between

In [46]:
sr1.between(2,3)

0    False
1     True
2     True
3    False
dtype: bool

5. All strings functions can be used to extract or modify texts in a series

 $\;\;\;\;\;\;$  $\;\;\;\;\;\;$ Upper and Lower Function<br>
    $\;\;\;\;\;\;$  $\;\;\;\;\;\;$ Len function<br>
        $\;\;\;\;\;\;$  $\;\;\;\;\;\;$ Strip Function<br>
        $\;\;\;\;\;\;$  $\;\;\;\;\;\;$ Split Function<br>
        $\;\;\;\;\;\;$  $\;\;\;\;\;\;$ Contains Function<br>
        $\;\;\;\;\;\;$  $\;\;\;\;\;\;$ Replace Function<br>
        $\;\;\;\;\;\;$  $\;\;\;\;\;\;$ Count Function<br>
        $\;\;\;\;\;\;$  $\;\;\;\;\;\;$ Startswith and Endswith Function<br>
        $\;\;\;\;\;\;$  $\;\;\;\;\;\;$ Find Finction<br>

6. Convert Series to list:

In [49]:
sr1.to_list()

[1, 2, 3, 4]

# 2. Pandas DataFrames: Always use 2d data as an input

In [25]:
# Creation of Dataframe:

# 1. np array: To create a dataframe from Numpy array, the array should be 2d.
data=np.array([[1,2,3],["j","d","p"]])
df=pd.DataFrame(data)
df

   0  1  2
0  1  2  3
1  j  d  p

In [29]:
# 2. List

data=[1,2,3,4]
b=pd.DataFrame(data)
b
# As seen below, DataFrame will generate two indexing - one for rows and another for coll's

   0
0  1
1  2
2  3
3  4

In [30]:
# 3. Dict

data = { 'Name'         :['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age'          :[27, 24, 22, 32],
         'Address'      :['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
         'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

df = pd.DataFrame(data)
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [50]:
# 4. Dataframe using custom index:

index=['worktype','age','sex','city']
data=["IT",32,'M','Toronto']

df=pd.DataFrame(data,index)
df

                0
worktype       IT
age            32
sex             M
city      Toronto

NOTE: The name of the colls will always be generated by the data provided. The index is the value that we provide.

In [52]:
data = {
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
}

df = pd.DataFrame(data)
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [54]:
# Renaming :columns"
df = df.rename(columns={'A': 'coll1', 'B': 'coll2', 'C': 'coll3'})

df

   coll1  coll2  coll3
0      1      4      7
1      2      5      8
2      3      6      9

In [55]:
# Renaming: "Index"

df = df.rename(index={0: 'index0',1: 'index1',2: 'index2'})
df

        coll1  coll2  coll3
index0      1      4      7
index1      2      5      8
index2      3      6      9

# 2.1 DataFrame functions

In [ ]:
# Sample dataframe

In [123]:
data = { 'Name'         :['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age'          :[27, 24, 22, 32],
         'Address'      :['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
         'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
index=['row0','row1','row2','row3']

df = pd.DataFrame(data,index)
df

        Name  Age    Address Qualification
row0     Jai   27      Delhi           Msc
row1  Princi   24     Kanpur            MA
row2  Gaurav   22  Allahabad           MCA
row3    Anuj   32    Kannauj           Phd

In [ ]:
# Adding a coll

In [127]:
df['city']=['calgary','toronto','vancuvr','kingston']
df['age_in_10']=df['Age']+10

df

        Name  Age    Address Qualification      city  age_in_10
row0     Jai   27      Delhi           Msc   calgary         37
row1  Princi   24     Kanpur            MA   toronto         34
row2  Gaurav   22  Allahabad           MCA   vancuvr         32
row3    Anuj   32    Kannauj           Phd  kingston         42

In [ ]:
# Del a coll

In [131]:
del df['city']

In [ ]:
# Addition of rows

In [134]:
df

        Name  Age    Address Qualification  age_in_10
row0     Jai   27      Delhi           Msc         37
row1  Princi   24     Kanpur            MA         34
row2  Gaurav   22  Allahabad           MCA         32
row3    Anuj   32    Kannauj           Phd         42

In [141]:
row4=["brainstation",10,'toronto dt','datascience',20]

df_r=pd.DataFrame([row4],columns=df.columns)

df2=pd.concat([df,df_r]).reset_index(drop=True)

df2

           Name  Age     Address Qualification  age_in_10
0           Jai   27       Delhi           Msc         37
1        Princi   24      Kanpur            MA         34
2        Gaurav   22   Allahabad           MCA         32
3          Anuj   32     Kannauj           Phd         42
4  brainstation   10  toronto dt   datascience         20

In [ ]:
# Dropping entire row or coll

In [142]:
#dropping colls
df2.drop(["age_in_10"],axis=1,inplace=True)
df2

           Name  Age     Address Qualification
0           Jai   27       Delhi           Msc
1        Princi   24      Kanpur            MA
2        Gaurav   22   Allahabad           MCA
3          Anuj   32     Kannauj           Phd
4  brainstation   10  toronto dt   datascience

In [143]:
#dropping row
df2.drop([4],axis=0,inplace=True)
df2

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

# 3. Indexing and Slicing of DataFrame and Series

Dataframe and series we dont use traditional indexing and slicing methods that are used with data structures of python such as list and tuples. 

We use iloc[] and loc[] functions for doing indexing and slicing operations. 

1. iloc[]: Intiger based location indexing

    You use it to select rows and columns by their integer positions
    
2. loc[]: Label based indexing

    You use it to select rows and columns by their label names
    
Syntax:
iloc[rows,colls]
loc[rows,colls]

# 3.1 Indexing and Slicing of DataFrame

In [94]:
# Sample dataframe
data = { 'Name'         :['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age'          :[27, 24, 22, 32],
         'Address'      :['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
         'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

df = pd.DataFrame(data)
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [ ]:
# loc: slicing

In [96]:
df.loc[1:3,"Age":"Address"]

   Age    Address
1   24     Kanpur
2   22  Allahabad
3   32    Kannauj

In [97]:
data = { 'Name'         :['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age'          :[27, 24, 22, 32],
         'Address'      :['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
         'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
index=['row0','row1','row2','row3']

df2 = pd.DataFrame(data,index)
df2

        Name  Age    Address Qualification
row0     Jai   27      Delhi           Msc
row1  Princi   24     Kanpur            MA
row2  Gaurav   22  Allahabad           MCA
row3    Anuj   32    Kannauj           Phd

In [99]:
df2.loc["row1":"row3","Age":"Address"]

      Age    Address
row1   24     Kanpur
row2   22  Allahabad
row3   32    Kannauj

In [102]:
# loc: indexing

In [121]:
df2.loc['row0',"Age"]

27

In [122]:
#Updating values
df2.loc['row0',"Age"]=100

In [104]:
# iloc: slicing

In [108]:
df.iloc[1:3,1:3]

   Age    Address
1   24     Kanpur
2   22  Allahabad

In [ ]:
# iloc: indexing

In [111]:
df.iloc[3]

Name                Anuj
Age                   32
Address          Kannauj
Qualification        Phd
Name: 3, dtype: object

In [113]:
# Sample Series

series = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])
series

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [ ]:
# iloc indexing

In [114]:
series.iloc[3]

40

In [117]:
series.iloc[3,]

40

In [ ]:
# iloc slicing

In [118]:
series.iloc[0:4]

a    10
b    20
c    30
d    40
dtype: int64

In [ ]:
# loc indexing

In [119]:
series.loc['b']

20

In [ ]:
# loc slicing

In [120]:
series.loc['b':'e']

b    20
c    30
d    40
e    50
dtype: int64

# 3.2 Slicing using a condition

df.loc['condition',[name of coll where cond needs to be run]

df.iloc['condition.values',[index of coll where condition needs to be run]
        condition.values=get the positions that meets the condition
        
Recomendation: Use loc and not iloc!

In [149]:
# Sample dataframe

df = pd.DataFrame({
    'Company': ['A', 'B', 'C', 'D'],
    'Count': [1, 2, 3, 4],
    'Location': ['X', 'Y', 'Z', 'W'],
    'Department': ['HR', 'Tech', 'Finance', 'HR']
})

df

  Company  Count Location Department
0       A      1        X         HR
1       B      2        Y       Tech
2       C      3        Z    Finance
3       D      4        W         HR

In [155]:
# 1. Selection of rows where count is > 2 using loc[]:

df.loc[df['Count']>2,['Count']]

   Count
2      3
3      4

In [157]:
# 1. Selection of rows where count is > 2 using iloc[]:

condition=df['Count']>2

df.iloc[condition.values,[1]]

   Count
2      3
3      4

In [ ]:
# 2. Selecting 'Company' and 'Location' columns where Department is 'HR' using loc

In [151]:
df.loc[df['Department']=='HR',['Company','Location']]

  Company Location
0       A        X
3       D        W

In [158]:
# 2. Selecting 'Company' and 'Location' columns where Department is 'HR' using iloc

condition=df['Department']=='HR'

df.iloc[condition.values,[0,2]]

  Company Location
0       A        X
3       D        W